{
	"title": {
            "text": {
                "headline": "The First World War",
                "text": "World War I or the First World War, often abbreviated as WWI or WW1, was a major global conflict that began on 28 July 1914 and ended on 11 November 1918. Referred to by contemporaries as the \"Great War\", its belligerents included much of Europe, the Russian Empire, the United States, and the Ottoman Empire, with fighting taking place across Europe, the Middle East, Africa and parts of Asia. New technology, including the recent invention of the airplane, trench warfare, and especially chemical weapons made it one of the deadliest conflicts in history. An estimated 9 million soldiers died in combat, with another 5 million civilian deaths as a result of military actions, hunger and disease. Millions more died in genocides within the Ottoman Empire and the 1918 influenza pandemic, which was exacerbated by the movement of combatants during the war."
            },
            "media": {
                "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/WWImontage.jpg/578px-WWImontage.jpg"
            }
    },
    "events": [
        {
            "start_date": {
                "year":	"1914",
				"month": "06",
                "day": "28"
            },
            "media": {
                "url": "https://i.pinimg.com/originals/7b/49/92/7b4992f9d19ceee603507add6d4c2be2.jpg"
            },
            "text": {
                "headline": "Assassination of Archduke Franz Ferdinand",
                "text": "At the Congress of Berlin that brought an end to the Russo-Turkish War in 1878, Austria-Hungary was given the right to occupy Ottoman Bosnia and Herzegovina. Thirty years later, Austria-Hungary formally annexed the territory, violating the Berlin treaty[1] and upsetting the fragile balance of power in the Balkans, precipitating a diplomatic crisis. Sarajevo became the provincial capital and Oskar Potiorek, a military commander, became governor of the province. In the summer of 1914, Emperor Franz Joseph ordered Archduke Franz Ferdinand, heir presumptive to the Austro-Hungarian throne, to attend military exercises due to be held in Bosnia. After the exercises, on 28 June, Ferdinand toured Sarajevo with his wife, Sophie. Six armed irredentists, five Bosnian Serbs and one Bosnian Muslim, coordinated by Danilo Ilić, seeking to free Bosnia of Austria-Hungarian colonial rule and unite all Southern Slavs, lay in wait along Ferdinand's announced motorcade route.[2]\n\nAt 10:10 a.m., Nedeljko Čabrinović threw a hand grenade at Ferdinand's motorcade damaging the following car and injuring its occupants.[3] Later that morning, Gavrilo Princip managed to shoot and kill Franz Ferdinand and Sophie as they drove back to visit the wounded in the hospital. Čabrinović and Princip took cyanide, but it only sickened them. Both were arrested.[4] Within 45 minutes of the shooting, Princip began telling his story to interrogators.[5] The next day, based on the interrogations of the two assassins, Potiorek telegraphed Vienna to announce that Princip and Čabrinović had conspired in Belgrade with others to obtain bombs, revolvers, and money to kill the Archduke. A police dragnet quickly caught most of the conspirators."
            },
            "group":  "Politics"
        },
        {
            "start_date": {
                "year":	"1914",
				"month": "06",
                "day": "29"
            },
            "end_date": {
                "year":	 "1914",
				"month": "07",
                "day":  "01"
            },
            "media": {
                "url": "https://en.wikipedia.org/wiki/July_Crisis#Austria-Hungary_edges_towards_war_with_Serbia_(29_June_%E2%80%93_1_July)"
            },
            "text": {
                "headline": "Austria-Hungary edges towards war with Serbia",
                "text": "With the assassination ironic assassination of a pacifist-leaning Archduke, the Austro-Hungarian empire began to push for war with its southern neighbor. Austria-Hungary issued an ultimatum issued to Serbia with purposefully unagreeable terms."
            },
            "group": "Politics"
        },
        {
            "start_date": {
                "year":	"1914",
				"month": "07",
                "day": "28"
            },
            "media": {
                "url": "https://i.redd.it/s7me88r34wc71.jpg"
            },
            "text": {
                "headline": "Austria-Hungary declares war on Serbia",
                "text": "Backed by assurances from its ally, Germany, Austria-Hungary officially began its war of retribution on Serbia, firing the first shots of the war early in the morning on the 29th of July. By the 12th of August, Germany and Austria-Hungary were at war with Serbia, Russia, France, England, and Belgium."
            },
            "group": "Eastern Theatre"
        },
        {
            "start_date": {
                "year": "1914",
				"month": "07",
                "day": "29"
            },
            "end_date": {
                "year": "1914",
                "month": "08",
                "day": "07"
            },
            "media": {
                "url": "https://preview.redd.it/1jxho6nwc1871.jpg?auto=webp&s=9ba49d90a37960a26437c197a4221a4900f63e0c"
            },
            "text": {
                "headline": "Europe Descends Into War",
                "text": "In one of the most shocking domino effects in modern history... in just over one week's time: Germany declares war on Russia and France, invades Luxembourg and Belgium, and forges a secret alliance with the Ottoman Empire. In response to the violation of Belgian neutrality, the United Kingdom and its dominions declare war on Germany. Montenegro declares war on Austria-Hungary, Austria-Hungary declares war on Russia, and Serbia declares war on Germany."
            },
            "group": "Politics"
        },
        {
            "start_date": {
                "year": "1914",
				"month": "08",
                "day": "07"
            },
            "end_date": {
                "year": "1914",
                "month": "09",
                "day": "06"
            },
            "media": {
                "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Bataille_des_Fronti%C3%A8res.svg/1024px-Bataille_des_Fronti%C3%A8res.svg.png"
            },
            "text": {
                "headline": "Battle of the Frontiers",
                "text": "The Germans obtain a victory against the British Expeditionary Force and France's Fifth Army. The Germans, French, British and Belgians had tasted the cost of full-scale mechanized warfare. In less than a month, combined casualties would exceed 664,000. Find out more at: <a href='https://en.wikipedia.org/wiki/Battle_of_the_Frontiers'>The Battle of the Frontiers</a>"
            },
            "group": "Western Front"
        },
        {
            "start_date": {
                "year": "1914",
				"month": "08",
                "day": "06"
            },
            "media": {
                "url": "https://i.imgur.com/ZVXUq2J.jpg"
            },
            "text": {
                "headline": "War Reaches Africa",
                "text": "At the onset of WWI, the African continent remained largely colonized. Despite agreements of colonial neutrality in the event of a European war, as stated in the Congo Act of 1885, France and Britain invaded the German protectorate of Togoland. Find out more at: <a href='https://en.wikipedia.org/wiki/Togoland_campaign'>Togoland Campgain Summary and Aftermath</a>"
            },
            "group": "West African Campaign"
        }

    ]
}